knieriem/tinygo-stm32-svd/svd/stm32n647.svd
        <register>
          <name>FCR1</name>
          <displayName>FCR1</displayName>
          <description>CSI-2 Host flag clear register 1</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CESOTDL0F</name>
              <description>Clear SOT error flag on lane 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CESOTSYNCDL0F</name>
              <description>Clear SOT synchronization error flag on lane 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CEESCDL0F</name>
              <description>Clear D-PHY_RX lane 0 escape entry error flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CESYNCESCDL0F</name>
              <description>Clear D-PHY_RX lane 0 low-power data transmission synchronization error flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CECTRLDL0F</name>
              <description>Clear D-PHY_RX lane 0 control error flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CESOTDL1F</name>
              <description>Clear SOT error flag on lane 1</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CESOTSYNCDL1F</name>
              <description>Clear SOT synchronization error flag on lane 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CEESCDL1F</name>
              <description>Clear D-PHY_RX lane 1 escape entry error flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CESYNCESCDL1F</name>
              <description>Clear D-PHY_RX lane 1 low-power data transmission synchronization error flag</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>CECTRLDL1F</name>
              <description>Clear D-PHY_RX lane 1 control error flag</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPDFR</name>
          <displayName>SPDFR</displayName>
          <description>CSI-2 Host short packet data field register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATAFIELD</name>
              <description>Data field</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATATYPE</name>
              <description>Data type class</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VCHANNEL</name>
              <description>Virtual channel</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR1</name>
          <displayName>ERR1</displayName>
          <description>CSI-2 Host error register 1</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CRCDTERR</name>
              <description>Data type having a CRC error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CRCVCERR</name>
              <description>Virtual channel having a CRC error</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CECCDTERR</name>
              <description>Data type having a corrected ECC error</description>
              <bitOffset>8</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CECCVCERR</name>
              <description>Virtual channel having a corrected ECC error</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDDTERR</name>
              <description>Data type in error</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>IDVCERR</name>
              <description>Virtual channel having ID error</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ERR2</name>
          <displayName>ERR2</displayName>
          <description>CSI-2 Host error register 2</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SPKTDTERR</name>
              <description>Data type having a short packet error</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SPKTVCERR</name>
              <description>Virtual channel having a short packet error</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WDVCERR</name>
              <description>Virtual channel having a watchdog error</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SYNCVCERR</name>
              <description>Virtual channel having synchronization error</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRCR</name>
          <displayName>PRCR</displayName>
          <description>CSI PHY reset control register</description>
          <addressOffset>0x1000</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PEN</name>
              <description>When set to 0, this bit places the digital section of the D-PHY in the reset state.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCR</name>
          <displayName>PMCR</displayName>
          <description>CSI PHY mode control register</description>
          <addressOffset>0x1004</addressOffset>
          <size>0x20</size>
          <resetValue>0x00011003</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRXMDL0</name>
              <description>Force to Rx mode the data lane 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRXMDL1</name>
              <description>Force to Rx mode the data lane 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FTXSMDL0</name>
              <description>Force to Tx Stop mode the data lane 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DTDL</name>
              <description>Disable turn-around data lane 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTDL0</name>
              <description>Turn-around request data lane 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUESDL0</name>
              <description>Tx ULP escape-mode data lane 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TUEXDL0</name>
              <description>Tx ULP exit sequence data lane 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PFCR</name>
          <displayName>PFCR</displayName>
          <description>CSI PHY frequency control register</description>
          <addressOffset>0x1008</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000017</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>CCFR</name>
              <description>Configuration clock frequency range selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HSFR</name>
              <description>PHY high-speed frequency range selection</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLD</name>
              <description>Data lane direction of lane 0</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTCR0</name>
          <displayName>PTCR0</displayName>
          <description>CSI PHY test control register 0</description>
          <addressOffset>0x1010</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TCKEN</name>
              <description>Test-interface clock enable for the TDI bus into the PHY</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TRSEN</name>
              <description>Test-interface reset enable for the TDI bus into the PHY</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTCR1</name>
          <displayName>PTCR1</displayName>
          <description>CSI PHY test control register 1</description>
          <addressOffset>0x1014</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDI</name>
              <description>Test-interface data in</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TWM</name>
              <description>Test-interface write mode selector</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PTSR</name>
          <displayName>PTSR</displayName>
          <description>CSI PHY test status register</description>
          <addressOffset>0x1018</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TDO</name>
              <description>CSI PHY test interface data output bus for read-back and internal probing functionalities</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
