knieriem/tinygo-stm32-svd/svd/stm32n647.svd
        <register>
          <name>P1CCCBR1</name>
          <displayName>P1CCCBR1</displayName>
          <description>DCMIPP Pipex current ColorConv blue coefficient register 1</description>
          <addressOffset>0xA94</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BR</name>
              <description>Current coefficient row 3 column 1 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BG</name>
              <description>Current coefficient row 3 column 2 of the matrix</description>
              <bitOffset>16</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCCBR2</name>
          <displayName>P1CCCBR2</displayName>
          <description>DCMIPP Pipe1 current ColorConv blue coefficient register 2</description>
          <addressOffset>0xA98</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BB</name>
              <description>Current coefficient row 3 column 3 of the matrix</description>
              <bitOffset>0</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BA</name>
              <description>Current coefficient row 3 of the added column (signed integer value)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCTCR1</name>
          <displayName>P1CCTCR1</displayName>
          <description>DCMIPP Pipe1 current contrast control register 1</description>
          <addressOffset>0xAA0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00002000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>Current ENABLE bit value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LUM0</name>
              <description>Current luminance increase for input luminance of 0 (increase is idle with LUMx = 16)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCTCR2</name>
          <displayName>P1CCTCR2</displayName>
          <description>DCMIPP Pipe1 current contrast control register 2</description>
          <addressOffset>0xAA4</addressOffset>
          <size>0x20</size>
          <resetValue>0x20202020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUM4</name>
              <description>Current luminance increase for input luminance of 128 (increase is idle with LUMx = 16)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LUM3</name>
              <description>Current luminance increase for input luminance of 96 (increase is idle with LUMx = 16)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LUM2</name>
              <description>Current luminance increase for input luminance of 64 (increase is idle with LUMx = 16)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LUM1</name>
              <description>Current luminance increase for input luminance of 32 (increase is idle with LUMx = 16)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCTCR3</name>
          <displayName>P1CCTCR3</displayName>
          <description>DCMIPP Pipe1 current contrast control register 3</description>
          <addressOffset>0xAA8</addressOffset>
          <size>0x20</size>
          <resetValue>0x20202020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>LUM8</name>
              <description>Luminance increase for input luminance of 256 (increase is idle with LUMx = 16)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LUM7</name>
              <description>Luminance increase for input luminance of 224 (increase is idle with LUMx = 16)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LUM6</name>
              <description>Luminance increase for input luminance of 192 (increase is idle with LUMx = 16)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LUM5</name>
              <description>Luminance increase for input luminance of 160 (increase is idle with LUMx = 16)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CFCTCR</name>
          <displayName>P1CFCTCR</displayName>
          <description>DCMIPP Pipex current flow control configuration register</description>
          <addressOffset>0xB00</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRATE</name>
              <description>Frame capture rate control</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPTMODE</name>
              <description>Capture mode</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CPTREQ</name>
              <description>Capture requested</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCRSTR</name>
          <displayName>P1CCRSTR</displayName>
          <description>DCMIPP Pipex current crop window start register</description>
          <addressOffset>0xB04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCRSZR</name>
          <displayName>P1CCRSZR</displayName>
          <description>DCMIPP Pipex current crop window size register</description>
          <addressOffset>0xB08</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Current ENABLE bit value.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CDCCR</name>
          <displayName>P1CDCCR</displayName>
          <description>DCMIPP Pipex current decimation register</description>
          <addressOffset>0xB0C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>None</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDEC</name>
              <description>Horizontal decimation ratio</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VDEC</name>
              <description>Vertical decimation ratio</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CDSCR</name>
          <displayName>P1CDSCR</displayName>
          <description>DCMIPP Pipex current downsize configuration register</description>
          <addressOffset>0xB10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HDIV</name>
              <description>Current horizontal division factor, from 128 (8x) to 1023 (1x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VDIV</name>
              <description>Current vertical division factor, from 128 (8x) to 1023 (1x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Current value of bit ENABLE</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CDSRTIOR</name>
          <displayName>P1CDSRTIOR</displayName>
          <description>DCMIPP Pipex current downsize ratio register</description>
          <addressOffset>0xB14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HRATIO</name>
              <description>Current horizontal ratio, from 8192 (1x) to 65535 (8x)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VRATIO</name>
              <description>Current vertical ratio, from 8192 (1x) to 65535 (8x)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CDSSZR</name>
          <displayName>P1CDSSZR</displayName>
          <description>DCMIPP Pipex current downsize destination size register</description>
          <addressOffset>0xB18</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CCMRICR</name>
          <displayName>P1CCMRICR</displayName>
          <description>DCMIPP Pipex current common ROI configuration register</description>
          <addressOffset>0xB20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ROILSZ</name>
              <description>Current region of interest line size width</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROI1EN</name>
              <description>Current region of interest 1 enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROI2EN</name>
              <description>Current region of interest 2 enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROI3EN</name>
              <description>Current region of interest 3 enable</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROI4EN</name>
              <description>Current region of interest 4 enable</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROI5EN</name>
              <description>Current region of interest 5 enable</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROI6EN</name>
              <description>Current region of interest 6 enable</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROI7EN</name>
              <description>Current region of interest 7 enable</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ROI8EN</name>
              <description>Current region of interest 8 enable</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI1CR1</name>
          <displayName>P1CRI1CR1</displayName>
          <description>DCMIPP Pipe1 current ROI1 configuration register 1</description>
          <addressOffset>0xB24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Current color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Current color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Current color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI1CR2</name>
          <displayName>P1CRI1CR2</displayName>
          <description>DCMIPP Pipe1 current ROI1 configuration register 2</description>
          <addressOffset>0xB28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI2CR1</name>
          <displayName>P1CRI2CR1</displayName>
          <description>DCMIPP Pipe1 current ROI2 configuration register 1</description>
          <addressOffset>0xB2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Current color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Current color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Current color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI2CR2</name>
          <displayName>P1CRI2CR2</displayName>
          <description>DCMIPP Pipe1 current ROI2 configuration register 2</description>
          <addressOffset>0xB30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
