knieriem/tinygo-stm32-svd/svd/stm32n647.svd
        <register>
          <name>P1CRI3CR1</name>
          <displayName>P1CRI3CR1</displayName>
          <description>DCMIPP Pipe1 current ROI3 configuration register 1</description>
          <addressOffset>0xB34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Current color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Current color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Current color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI3CR2</name>
          <displayName>P1CRI3CR2</displayName>
          <description>DCMIPP Pipe1 current ROI3 configuration register 2</description>
          <addressOffset>0xB38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI4CR1</name>
          <displayName>P1CRI4CR1</displayName>
          <description>DCMIPP Pipe1 current ROI4 configuration register 1</description>
          <addressOffset>0xB3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Current color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Current color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Current color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI4CR2</name>
          <displayName>P1CRI4CR2</displayName>
          <description>DCMIPP Pipe1 current ROI4 configuration register 2</description>
          <addressOffset>0xB40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI5CR1</name>
          <displayName>P1CRI5CR1</displayName>
          <description>DCMIPP Pipe1 current ROI5 configuration register 1</description>
          <addressOffset>0xB44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Current color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Current color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Current color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI5CR2</name>
          <displayName>P1CRI5CR2</displayName>
          <description>DCMIPP Pipe1 current ROI5 configuration register 2</description>
          <addressOffset>0xB48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI6CR1</name>
          <displayName>P1CRI6CR1</displayName>
          <description>DCMIPP Pipe1 current ROI6 configuration register 1</description>
          <addressOffset>0xB4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Current color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Current color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Current color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI6CR2</name>
          <displayName>P1CRI6CR2</displayName>
          <description>DCMIPP Pipe1 current ROI6 configuration register 2</description>
          <addressOffset>0xB50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI7CR1</name>
          <displayName>P1CRI7CR1</displayName>
          <description>DCMIPP Pipe1 current ROI7 configuration register 1</description>
          <addressOffset>0xB54</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Current color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Current color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Current color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI7CR2</name>
          <displayName>P1CRI7CR2</displayName>
          <description>DCMIPP Pipe1 current ROI7 configuration register 2</description>
          <addressOffset>0xB58</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI8CR1</name>
          <displayName>P1CRI8CR1</displayName>
          <description>DCMIPP Pipe1 current ROI8 configuration register 1</description>
          <addressOffset>0xB5C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSTART</name>
              <description>Current horizontal start, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLB</name>
              <description>Current color line blue</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLG</name>
              <description>Current color line green</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSTART</name>
              <description>Current vertical start, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CLR</name>
              <description>Current color line red</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CRI8CR2</name>
          <displayName>P1CRI8CR2</displayName>
          <description>DCMIPP Pipe1 current ROI8 configuration register 2</description>
          <addressOffset>0xB60</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HSIZE</name>
              <description>Current horizontal size, from 0 to 4094 pixels wide</description>
              <bitOffset>0</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VSIZE</name>
              <description>Current vertical size, from 0 to 4094 pixels high</description>
              <bitOffset>16</bitOffset>
              <bitWidth>12</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPCR</name>
          <displayName>P1CPPCR</displayName>
          <description>DCMIPP Pipe1 current pixel packer configuration register</description>
          <addressOffset>0xBC0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FORMAT</name>
              <description>Memory format</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SWAPRB</name>
              <description>Swaps R-vs-B components if RGB, and U-vs-V components if YUV</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LINEMULT</name>
              <description>Amount of capture completed lines for LINE Event and Interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DBM</name>
              <description>Double buffer mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LMAWM</name>
              <description>Line multi address wrapping modulo</description>
              <bitOffset>17</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>LMAWE</name>
              <description>Line multi address wrapping enable bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM0AR1</name>
          <displayName>P1CPPM0AR1</displayName>
          <description>DCMIPP Pipe1 current pixel packer Memory0 address register 1</description>
          <addressOffset>0xBC4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM0AR2</name>
          <displayName>P1CPPM0AR2</displayName>
          <description>DCMIPP Pipe1 current pixel packer Memory0 address register 2</description>
          <addressOffset>0xBC8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M0A</name>
              <description>Memory0 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM0PR</name>
          <displayName>P1CPPM0PR</displayName>
          <description>DCMIPP Pipex current pixel packer Memory0 pitch register</description>
          <addressOffset>0xBCC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Current number of bytes between the address of two consecutive lines.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM1AR1</name>
          <displayName>P1CPPM1AR1</displayName>
          <description>DCMIPP Pipex current pixel packer Memory1 address register 1</description>
          <addressOffset>0xBD4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M1A</name>
              <description>Memory1 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM1AR2</name>
          <displayName>P1CPPM1AR2</displayName>
          <description>DCMIPP Pipex current pixel packer Memory1 address register 2</description>
          <addressOffset>0xBD8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M1A</name>
              <description>Memory1 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM1PR</name>
          <displayName>P1CPPM1PR</displayName>
          <description>DCMIPP Pipex current pixel packer Memory1 pitch register</description>
          <addressOffset>0xBDC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PITCH</name>
              <description>Current number of bytes between the address of two consecutive lines</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM2AR1</name>
          <displayName>P1CPPM2AR1</displayName>
          <description>DCMIPP Pipex current pixel packer Memory2 address register 1</description>
          <addressOffset>0xBE4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M2A</name>
              <description>Memory 2 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>P1CPPM2AR2</name>
          <displayName>P1CPPM2AR2</displayName>
          <description>DCMIPP Pipex current pixel packer Memory2 address register 1</description>
          <addressOffset>0xBE8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>M2A</name>
              <description>Memory 2 address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
