knieriem/tinygo-stm32-svd/svd/stm32n647.svd
        <register>
          <name>SWREG130</name>
          <displayName>SWREG130</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x208</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG131</name>
          <displayName>SWREG131</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x20C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG132</name>
          <displayName>SWREG132</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG133</name>
          <displayName>SWREG133</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x214</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG134</name>
          <displayName>SWREG134</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x218</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG135</name>
          <displayName>SWREG135</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x21C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG136</name>
          <displayName>SWREG136</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG137</name>
          <displayName>SWREG137</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x224</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG138</name>
          <displayName>SWREG138</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x228</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG139</name>
          <displayName>SWREG139</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x22C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG140</name>
          <displayName>SWREG140</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x230</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG141</name>
          <displayName>SWREG141</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x234</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG142</name>
          <displayName>SWREG142</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x238</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG143</name>
          <displayName>SWREG143</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x23C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG144</name>
          <displayName>SWREG144</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x240</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG145</name>
          <displayName>SWREG145</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x244</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG146</name>
          <displayName>SWREG146</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x248</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG147</name>
          <displayName>SWREG147</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x24C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG148</name>
          <displayName>SWREG148</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x250</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG149</name>
          <displayName>SWREG149</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x254</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG150</name>
          <displayName>SWREG150</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x258</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG151</name>
          <displayName>SWREG151</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x25C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG152</name>
          <displayName>SWREG152</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x260</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG153</name>
          <displayName>SWREG153</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x264</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG154</name>
          <displayName>SWREG154</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x268</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG155</name>
          <displayName>SWREG155</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x26C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG156</name>
          <displayName>SWREG156</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x270</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG157</name>
          <displayName>SWREG157</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x274</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG158</name>
          <displayName>SWREG158</displayName>
          <description>VENC DMV qpel penalty values register</description>
          <addressOffset>0x278</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG159</name>
          <displayName>SWREG159</displayName>
          <description>VENC DMV qpel penalty values 124-127 register</description>
          <addressOffset>0x27C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>DMV qpel penalty values 124-127 (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG231</name>
          <displayName>SWREG231</displayName>
          <description>VENC base address for output of down-scaled encoder image	in YUYV 4:2:2 format register</description>
          <addressOffset>0x39C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for output of down-scaled encoder image in YUYV 4:2:2 format (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG232</name>
          <displayName>SWREG232</displayName>
          <description>VENC scaling control register</description>
          <addressOffset>0x3A0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Scaling control (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG233</name>
          <displayName>SWREG233</displayName>
          <description>VENC scaling control register</description>
          <addressOffset>0x3A4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Scaling control (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG236</name>
          <displayName>SWREG236</displayName>
          <description>VENC squared error output calculated for 13x13 pixels	per macroblock register</description>
          <addressOffset>0x3B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Squared error output calculated for 13x13 pixels per macroblock (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG237</name>
          <displayName>SWREG237</displayName>
          <description>VENC MAD 2 control and output register</description>
          <addressOffset>0x3B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>MAD 2 control and output (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
