knieriem/tinygo-stm32-svd/svd/stm32n647.svd
        <register>
          <name>SWREG419</name>
          <displayName>SWREG419</displayName>
          <description>VENC base address for second reference chroma register</description>
          <addressOffset>0x68C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>average of MB complexity (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG420</name>
          <displayName>SWREG420</displayName>
          <description>VENC limit of chroma RFC buffer register</description>
          <addressOffset>0x690</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>average of MB complexity (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG421</name>
          <displayName>SWREG421</displayName>
          <description>VENC reorder control register</description>
          <addressOffset>0x694</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Reorder control (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG422</name>
          <displayName>SWREG422</displayName>
          <description>VENC AXI read ID register</description>
          <addressOffset>0x698</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>AXI Read ID (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG423</name>
          <displayName>SWREG423</displayName>
          <description>VENC base address MSB for reference luma compression table	register</description>
          <addressOffset>0x69C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>AXI Read ID (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG424</name>
          <displayName>SWREG424</displayName>
          <description>VENC base address MSB for reference chroma compression table	register</description>
          <addressOffset>0x6A0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>AXI Read ID (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG425</name>
          <displayName>SWREG425</displayName>
          <description>VENC base address MSB for reconstructed luma compression	table register</description>
          <addressOffset>0x6A4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>AXI Read ID (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG426</name>
          <displayName>SWREG426</displayName>
          <description>VENC base address for reconstructed chroma compression	table register</description>
          <addressOffset>0x6A8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address for reconstructed chroma compression table (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG427</name>
          <displayName>SWREG427</displayName>
          <description>VENC base address MSB for second reference luma compression	table register</description>
          <addressOffset>0x6AC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address MSB for second reference luma compression table (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG428</name>
          <displayName>SWREG428</displayName>
          <description>VENC base address MSB for second reference chroma compression	table register</description>
          <addressOffset>0x6B0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Base address MSB for second reference chroma compression table (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG429</name>
          <displayName>SWREG429</displayName>
          <description>VENC high 32 bits of base address for output stream	data register</description>
          <addressOffset>0x6B4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for output stream data (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG430</name>
          <displayName>SWREG430</displayName>
          <description>VENC high 32 bits of base address for output control	data register</description>
          <addressOffset>0x6B8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for output control data (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG431</name>
          <displayName>SWREG431</displayName>
          <description>VENC high 32 bits of base address for reference luma	register</description>
          <addressOffset>0x6BC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for reference luma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG432</name>
          <displayName>SWREG432</displayName>
          <description>VENC high 32 bits of base address for reference chroma	register</description>
          <addressOffset>0x6C0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for reference chroma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG433</name>
          <displayName>SWREG433</displayName>
          <description>VENC high 32 bits of base address for reconstructed luma	register</description>
          <addressOffset>0x6C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for reconstructed luma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG434</name>
          <displayName>SWREG434</displayName>
          <description>VENC high 32 bits of base address for reconstructed chroma	register</description>
          <addressOffset>0x6C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for reconstructed chroma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG435</name>
          <displayName>SWREG435</displayName>
          <description>VENC high 32 bits of base address for input picture luma	register</description>
          <addressOffset>0x6CC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for input picture luma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG436</name>
          <displayName>SWREG436</displayName>
          <description>VENC high 32 bits of base address for input picture cb register</description>
          <addressOffset>0x6D0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for input picture cb (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG437</name>
          <displayName>SWREG437</displayName>
          <description>VENC high 32 bits of base address for input picture cr	register</description>
          <addressOffset>0x6D4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for input picture cr (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG438</name>
          <displayName>SWREG438</displayName>
          <description>VENC high 32 bits of base address for second reference	luma register</description>
          <addressOffset>0x6D8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for second reference luma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG439</name>
          <displayName>SWREG439</displayName>
          <description>VENC high 32 bits of base address for second reference	chroma register</description>
          <addressOffset>0x6DC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for second reference chroma (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG440</name>
          <displayName>SWREG440</displayName>
          <description>VENC high 32 bits of H264 secondary ref pic base	register</description>
          <addressOffset>0x6E0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of H264 secondary ref pic base (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG441</name>
          <displayName>SWREG441</displayName>
          <description>VENC high 32 bits of H264 secondary ref pic base	register</description>
          <addressOffset>0x6E4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of H264 secondary ref pic base (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG442</name>
          <displayName>SWREG442</displayName>
          <description>VENC high 32 bits of base address for next pic luminance	register</description>
          <addressOffset>0x6E8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for next pic luminance (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG443</name>
          <displayName>SWREG443</displayName>
          <description>VENC high 32 bits of base address for cabac context tables H264	register</description>
          <addressOffset>0x6EC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for cabac context tables (H264) or probability tables (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG444</name>
          <displayName>SWREG444</displayName>
          <description>VENC high 32 bits of base address for MV output writing	register</description>
          <addressOffset>0x6F0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for MV output writing (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG449</name>
          <displayName>SWREG449</displayName>
          <description>VENC high 32 bits of base address for output of down-scaled	encoder image in YUYV 4:2:2 format register</description>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>high 32 bits of Base address for output of down-scaled encoder image in YUYV 4:2:2 format (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG497</name>
          <displayName>SWREG497</displayName>
          <description>VENC low-latency control register</description>
          <addressOffset>0x7C4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Low latency control (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWREG498</name>
          <displayName>SWREG498</displayName>
          <description>VENC encoder line buffer offset	register</description>
          <addressOffset>0x7C8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SWREG_FIELD</name>
              <description>Low latency control (all format mode)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
